<!DOCTYPE html>
<html>
<head>
	<title>Lab Git</title>
</head>
<body>
	<h1>Hello Git</h1>
    <h1>Git Deploy</h1>
    <p>Git<br> 
เป็นระบบควบคุมเวอร์ชั่นแบบ Open Source เป็นเครื่องมือที่ใช้ในการบริหารจัดการเปลี่ยนแปลงของไฟล์ต่าง ๆ ใน Project หากเกิดความผิดพลาดหรือเสียหายจากการแก้ไข ก็จะสามารถย้อนกลับไปการแก้ไขครั้งก่อน ๆ ได้
<br>Github
<br>เป็นบริษัทหนึ่งที่ให้บริการGit repository บนพื้นฐานของเว็บ โดย Github จะให้พื้นที่เราสร้าง Repository สำหรับโปรเจค ให้บริการฟังก์ชันการทำงานพื้นฐานของระบบ git เช่น Branches, Merges และ Commits อีกทั้งยังให้พื้นที่สำหรับแจ้งข้อผิดพลาด บัก หรือความต้องการเพิ่มเติม Features ต่าง ๆ ตลอดจนมีความสามารถในการเขียนคำอธิบายแบบ wiki ใน repository นั้น ๆ ด้วย
<br>Deploy
<br>เป็นการนำเอากระบวนการต่าง ๆ ตั้งแต่การพัฒนา ทดสอบ และส่งมอบให้เป็นอัตโนมัติทั้งหมด ทุก ๆ การเปลี่ยนแปลงที่นำขึ้นไปเก็บที่ Source Code หลัก จะถูกนำมาทดสอบว่าทำงานถูกหรือไม่ ตรงตามสิ่งที่ผู้ใช้งานคาดหวังหรือเปล่า หรือมีคุณภาพตามที่ตั้งใจไว้ไหม จนเมื่อผ่านการทดสอบหมดแล้ว สามารถมีของให้ลูกค้าได้ใช้งานทันที และหากเกิดข้อผิดพลาด ทีมพัฒนาต้องได้รับ Feedback ได้เร็วที่สุด

</p>
</body>
</html>